
/**

  Задача о восьми ферзях:
  1. Узнать количество положение ферзей, при которых они не бьют друг друга.
  2. Выбрать одну пару компинаций (т.к. положения будут зеркальными)
  3. Положения зеркальны относительно горизонтальной плоскости.

*/

#include <iostream>

using namespace std;

int main() {
  int stop;

  std::cout << "Chess Queen initial." << '\n';
  cin >> stop;
  return 0;
}
